lib/dnd_api.rb

INSERT INTO "abilities" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def abilities
        request_hash = self.class.get('/api/features').parsed_response
        request_hash["results"].each do |result|
            @url = result["url"]
            @description = description(@url)

            Ability.create(name: result["name"], description: @description)