lib/dnd_api.rb

INSERT INTO "spells" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "job_spells" ("job_id", "spell_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["job_id", 360], ["spell_id", 743], ["created_at", "2020-05-27 16:48:24.313202"], ["updated_at", "2020-05-27 16:48:24.313202"]]
---
    def spells
        request_hash = self.class.get('/api/spells').parsed_response
        request_hash["results"].each do |result|
            @url = result["url"]
            @description = description(@url)
            @spell = Spell.create(name: result["name"], description: @description)

            @spell_info = spell_class_info(@url)
            related_jobs = @spell_info.map { |class_hash| class_hash["name"] }

            related_jobs.each do |class_name|
                @job = Job.find_by(name: class_name)
                JobSpell.create(job: @job, spell: @spell)

INSERT INTO "abilities" ("name", "description", "created_at", "updated_at", "job_id") VALUES (?, ?, ?, ?, ?)
---
    def abilities
        request_hash = self.class.get('/api/features').parsed_response
        request_hash["results"].each do |result|
            byebug
            @url = result["url"]
            @description = description(@url)

            @job_name = abilities_class(@url)

            @job = Job.find_by(name: @job_name)
            Ability.create(name: result["name"], description: @description, job_id: @job)