app/controllers/character_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_char
    @character = Character.find(params[:id])