app/controllers/spells_controller.rb

    def index
        @spells = Spell.all
---
SELECT "spells".* FROM "spells"